import numpy as np

# 条件値（いずれ設定ファイルにまとめる）
dt = 0.002
Tend = 3.0

TE = 1.2  # 駆動時間
SE = np.pi * (4 / 4)  # 目標角

Nrk = round(Tend / dt)
Nte = round(TE / dt)

# リンク1のパラメータ
ome1 = 12.68 * 0.993
z1 = 15.49 * 10 ** (-3) * 1.214
a1 = 2.266 * 10 ** (-1) * 0.984
b1 = 2.004 * 10 ** (-3) * 1.020

# リンク2のパラメータ
ome2 = 10.71 * 0.993
z2 = 14.27 * 10 ** (-3) * 1.071
a2 = 2.570 * 10 ** (-1) * 1.003
b2 = 5.822 * 10 ** (-3) * 1.006

# トルク関数のパラメータ
g1 = 2.996 * 10 ** (-2) * 1.016
g2 = 6.652 * 10 ** (-2) * 1.018
g3 = 5.237 * 10 ** (-2) * 1.052
cs = 4.202 * 10 ** (-2) * 1.131
